{"/about/":{"data":{"":"Hi, I’m mushypea. I write about whatever’s on my mind - projects, ideas, or life."},"title":"About Me"},"/blog/20250225112503-emacs_hugo_website/":{"data":{"":"","installation#Installation":"","introduction#Introduction":"","setup#Setup":"","usage#Usage":"Introduction This is a short guide on how to setup a Hugo website where pages / posts can easily be captured and published from within Emacs. I will assume you have an Emacs distribution and github account setup.\nWhat I Use (at the time of writing):\nDoom Emacs (installation method may vary for different distributions) Website hosted with Github Pages Hugo ox-hugo (Emacs package) Hextra Hugo Theme Installation Hugo Install using preferred method, I used the following commands:\nsudo apt update sudo apt install hugo Check if Hugo is correctly installed by using:\nhugo version ox-hugo Install the ox-hugo Emacs package - I installed it using Melpa but feel free to use your preferred installation method.\nSetup Hugo Website First create a basic hugo site:\nhugo new site site-name Then cd into the newly created folder and init your git repository:\ncd site-name git init Hugo Themes I won’t cover the setup of hugo themes as each have different configuration options. However, you can install them by adding a git submodule:\ngit submodule add https://link-to-theme.git themes/theme-name And then enable it in hugo.toml:\necho 'theme = \"theme-name\"' \u003e\u003e config.toml ox-hugo Configuration The basic variables needed to start publishing org notes to your hugo website are org-hugo-section and org-hugo-base-dir\n(setq org-hugo-section \"website-section\") ;;e.g. where you want your pages/posts to appear - \"blog\" for website.github.io/blog (setq org-hugo-base-dir \"~/path-to-your-hugo-website-folder\") Usage In any .org file you can run the command:\norg-hugo-export-wim-md It will use the default values for org-hugo-section and org-hugo-base-dir set above - e.g. if using “blog” as section a new post will appear (depending on your theme).\nCustomise Export Settings Per File org-hugo-section and org-hugo-base-dir can be set on a per file basis by including metadata at the top of the org mode file in this format:\n#+HUGO_BASE_DIR: /path/to/your/hugo/site #+HUGO_SECTION: section-name "},"title":"Emacs Hugo Website"}}